export const dataset = {
    // x-axis
    labels: [
`ШI створюватиме персоналізовані навчальні матеріали, 
адаптуючи їх та практичні завдання під рівень знань і 
потреби кожного студента`, 

`ШІ оцінюватиме сильні і слабкі сторони студента, відповідно 
відкориговуючи навчальні матеріали, аби подати складніші 
для розуміння теми у більш доступній формі`,

`Віртуальні інтелектуальні репетитори на основі ШІ 
надаватимуть допомогу з будь-якого предмету, аби 
«підтягнути» знання студентів з погано засвоєних тем`,

`ШІ надаватиме допомогу при підготовці до іспитів, 
пропонуючи питання для контролю знань і надаючи 
пояснення до неправильно виконаних завдань.`,

`Онлайн-платформи з підтримкою ШI забезпечуватимуть 
доступ до якісної освіти для студентів, які не можуть 
відвідувати заняття традиційним способам (оффлайн) через 
особливі фізичні потреби (розвиток інклюзивної освіти) `,

`Онлайн-платформи з підтримкою ШI надаватимуть 
можливості самонавчання і вдосконалення знань 
як для студентів, так і викладачів`,

`ШI допомагатиме автоматизувати рутинні 
завдання, наприклад, оцінювання практичних 
робіт, домашніх завдань, виконаних в 
електронному форматі `,

`Завдяки здатності аналізувати великі обсяги
даних ШІ оцінюватиме ефективність навчальних 
матеріалів і пропонуватиме варіанти їх покращення `,

`ШІ відстежуватиме відвідування лекцій, 
практичних занять та формуватиме 
журнали присутності`,

`ШІ прогнозуватиме успішність студентів 
на основі даних про їхні результати.`,

`Використання ШI у поєднанні з AR та VR для створення 
інтерактивних та захоплюючих навчальних середовищ 
сприятиме збільшенню інтересу студента до навчання`,

`Віртуальні екскурсії та лабораторії, надаватимуть 
студентам практичні навички в безпечному та 
контрольованому середовищі`
    ],
    datasets: [
      {
        label: 'Не погоджуюсь',
        data: [5, 4, 3, 0, 1, 2, 2, 4, 5, 1, 1, 0],
        backgroundColor: 'rgba(255, 99, 132, 0.2)',
        borderColor: 'rgba(255, 99, 132, 1)',
        borderWidth: 1,
      },
      {
        label: 'Частково не погоджуюсь',
        data: [7, 8, 8, 2, 3, 1, 4, 5, 3, 5, 4, 1],
        backgroundColor: 'rgba(54, 162, 235, 0.2)',
        borderColor: 'rgba(54, 162, 235, 1)',
        borderWidth: 1,
      },
      {
        label: 'Частково погоджуюсь',
        data: [8, 6, 8, 9, 12, 6, 8, 5, 7, 11, 10, 12],
        backgroundColor: 'rgba(255, 206, 5, 0.2)',
        borderColor: 'rgba(255, 206, 86, 1)',
        borderWidth: 1,
      },
      {
        label: 'Погоджуюсь',
        data: [5, 8, 7, 15, 10, 17, 12, 12, 10, 9, 9, 11],
        backgroundColor: 'rgba(75, 192, 192, 0.2)',
        borderColor: 'rgba(75, 192, 192, 1)',
        borderWidth: 1,
      }
    ],
};

export const datasetRec = {
    labels: [
`Запустити декілька пілотних проєктів з використанням 
ШІ у різних аспектах навчання, що дозволить 
протестувати технології в реальних умовах та оцінити 
їхню ефективність перед масштабним впровадженням.`, 

`Інвестувати в необхідну технічну інфраструктуру, 
включаючи техніку для швидкісного інтернет-з'єднання, 
сучасні комп'ютери та програмне забезпечення для 
підтримки ШІ-технологій.`, 

`Провести навчання для вчителів та адміністративного 
персоналу з метою пояснення можливостей, обмежень 
та шляхів найефективнішого використання технології ШІ`, 

`Розробити чіткі етичні стандарти для використання ШІ 
в навчанні, які включатимуть питання конфіденційності, 
безпеки даних та уникнення упередженостей в алгоритмах.`, 

`З моменту започаткування впровадити систему регулярного 
моніторингу і оцінювання впливу ШІ на навчальний процес. 
Зокрема збирати відгуки від студентів та викладачів і 
вносити корективи за необхідності.`, 
    ],
    datasets: [
      {
        label: 'Не погоджуюсь',
        data: [1, 0, 0, 3, 0],
        backgroundColor: 'rgba(255, 99, 132, 0.2)',
        borderColor: 'rgba(255, 99, 132, 1)',
        borderWidth: 1,
      },
      {
        label: 'Частково не погоджуюсь',
        data: [2, 4, 2, 1, 2],
        backgroundColor: 'rgba(54, 162, 235, 0.2)',
        borderColor: 'rgba(54, 162, 235, 1)',
        borderWidth: 1,
      },
      {
        label: 'Частково погоджуюсь',
        data: [5, 6, 9, 5, 6],
        backgroundColor: 'rgba(75, 192, 192, 0.2)',
        borderColor: 'rgba(75, 192, 192, 1)',
        borderWidth: 1,
      },
      {
        label: 'Погоджуюсь',
        data: [18, 16, 15, 17, 18],
        backgroundColor: 'rgba(255, 206, 5, 0.2)',
        borderColor: 'rgba(255, 206, 86, 1)',
        borderWidth: 1,
      }
    ],
};